Miter plane for Wall Foundation join is too far away; Bisecting plane will be used instead.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ContFootingCannotJoin { get; }
  Visual Basic
Public Shared ReadOnly Property ContFootingCannotJoin As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ContFootingCannotJoin {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace